app/views/posts/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.text_field :user_id %>
    <%= form.collection_select(:user_id, User.all, :id, :name, prompt: true) %>