app/controllers/posts_controller.rb

  def index
    @posts = Post.order('created_at DESC').page(params[:page]).per(10)
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "lool"], ["content", "loooool"], ["user_id", 1], ["created_at", "2021-06-17 09:38:56.655295"], ["updated_at", "2021-06-17 09:38:56.655295"]]